{
    "class_name": "Model",
    "config": {
        "name": "model_1",
        "layers": [{
            "name": "embedding_1_input",
            "class_name": "InputLayer",
            "config": {
                "batch_input_shape": [null, 38],
                "dtype": "float32",
                "sparse": false,
                "name": "embedding_1_input"
            },
            "inbound_nodes": []
        }, {
            "name": "dense_1_input",
            "class_name": "InputLayer",
            "config": {
                "batch_input_shape": [null, 2048],
                "dtype": "float32",
                "sparse": false,
                "name": "dense_1_input"
            },
            "inbound_nodes": []
        }, {
            "name": "embedding_1",
            "class_name": "Embedding",
            "config": {
                "name": "embedding_1",
                "trainable": true,
                "batch_input_shape": [null, 38],
                "dtype": "float32",
                "input_dim": 9957,
                "output_dim": 300,
                "embeddings_initializer": {
                    "class_name": "RandomUniform",
                    "config": {
                        "minval": -0.05,
                        "maxval": 0.05,
                        "seed": null
                    }
                },
                "embeddings_regularizer": null,
                "activity_regularizer": null,
                "embeddings_constraint": null,
                "mask_zero": false,
                "input_length": 38
            },
            "inbound_nodes": [
                [
                    ["embedding_1_input", 0, 0, {}]
                ]
            ]
        }, {
            "name": "dense_1",
            "class_name": "Dense",
            "config": {
                "name": "dense_1",
                "trainable": true,
                "batch_input_shape": [null, 2048],
                "dtype": "float32",
                "units": 300,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "inbound_nodes": [
                [
                    ["dense_1_input", 0, 0, {}]
                ]
            ]
        }, {
            "name": "lstm_1",
            "class_name": "LSTM",
            "config": {
                "name": "lstm_1",
                "trainable": true,
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                        "gain": 1.0,
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 1
            },
            "inbound_nodes": [
                [
                    ["embedding_1", 0, 0, {}]
                ]
            ]
        }, {
            "name": "repeat_vector_1",
            "class_name": "RepeatVector",
            "config": {
                "name": "repeat_vector_1",
                "trainable": true,
                "n": 38
            },
            "inbound_nodes": [
                [
                    ["dense_1", 0, 0, {}]
                ]
            ]
        }, {
            "name": "time_distributed_1",
            "class_name": "TimeDistributed",
            "config": {
                "name": "time_distributed_1",
                "trainable": true,
                "layer": {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "trainable": true,
                        "units": 300,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }
            },
            "inbound_nodes": [
                [
                    ["lstm_1", 0, 0, {}]
                ]
            ]
        }, {
            "name": "add_1",
            "class_name": "Add",
            "config": {
                "name": "add_1",
                "trainable": true
            },
            "inbound_nodes": [
                [
                    ["repeat_vector_1", 0, 0, {}],
                    ["time_distributed_1", 0, 0, {}]
                ]
            ]
        }, {
            "name": "sequential_3",
            "class_name": "Sequential",
            "config": [{
                "class_name": "Bidirectional",
                "config": {
                    "name": "bidirectional_1",
                    "trainable": true,
                    "batch_input_shape": [null, 38, 300],
                    "layer": {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_2",
                            "trainable": true,
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "units": 256,
                            "activation": "tanh",
                            "recurrent_activation": "hard_sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "implementation": 1
                        }
                    },
                    "merge_mode": "concat"
                }
            }, {
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "units": 9957,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            }, {
                "class_name": "Activation",
                "config": {
                    "name": "activation_1",
                    "trainable": true,
                    "activation": "softmax"
                }
            }],
            "inbound_nodes": [
                [
                    ["add_1", 0, 0, {}]
                ]
            ]
        }],
        "input_layers": [
            ["dense_1_input", 0, 0],
            ["embedding_1_input", 0, 0]
        ],
        "output_layers": [
            ["sequential_3", 1, 0]
        ]
    },
    "keras_version": "2.2.2",
    "backend": "tensorflow"
}